dbc_overflow/app/views/questions/show.html.erb

SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" ASC  [["question_id", 1]]
---

<% @question.answers.each do |answer| %>