dbc_overflow/app/controllers/answers_controller.rb

INSERT INTO "answers" ("content", "created_at", "question_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sdf"], ["created_at", "2015-05-19 03:00:20.695421"], ["question_id", 1], ["title", "sdf"], ["updated_at", "2015-05-19 03:00:20.695421"]]
---
  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_answer
      @answer = Answer.find(params[:id])