dbc_overflow/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @question = Question.new
    @questions = Question.all