dbc_overflow/app/controllers/questions_controller.rb

  def create
    @questions = Question.all
    p post_params
    puts "*****************"
    puts "*****************"
    puts "*****************"
    puts "*****************"
    @question = Question.new(post_params)
    # respond_to do |format|
    #  if @question.save
    #   # format.html { redirect_to @question, notice: "It worked" }
    #   format.json { render json: @question, status: :created }
    #   pry.debugger
    #  else
    #   format.html { render action: 'index'}
    #   format.json { render json: @question.errors.full_message, status: "Didn't work"}
     # end
     # redirect_to :back
     # redirect_to :action => :index
     if @question.save
---
INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "this is the third question content"], ["created_at", "2015-05-19 01:48:42.751103"], ["title", "third question"], ["updated_at", "2015-05-19 01:48:42.751103"]]

  def show
    @question = Question.where(id: params[:id]).first
    if @question
      @answers = @question.answers.order(:id)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 1  ORDER BY "questions"."id" ASC LIMIT 1
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" ASC  [["question_id", 1]]

  def index

    default_quote = "Hello there!"
    # response = HTTParty.get("https://api.github.com/zen", { params: ENV["CALVIN_TOKEN"]} )
    token = ENV["CALVIN_TOKEN"]
    response = HTTParty.get(
            "https://api.github.com/zen",
            :headers => {
                "Authorization" => "token #{token}",
                "User-Agent" => "cal"
                })

    if response.response.is_a? Net::HTTPForbidden
      @quote = default_quote
    else
      @quote = response.parsed_response
    end

    @question = Question.new
    @questions = Question.all.order(:id)
    @answers = Answer.all
---
SELECT "questions".* FROM "questions"   ORDER BY "questions"."id" ASC
SELECT "answers".* FROM "answers"

  def destroy
    @question = Question.find(params[:id])
    @question.destroy #destroys all the associated answers also
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 10]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @question = Question.find(params[:id])
    #saving
    @question.update_attributes(post_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "questions"."id" = 1  [["content", "content for first questiondfdf is longer"], ["title", "the first question sdfd"], ["updated_at", "2015-05-19 23:39:43.953761"]]

  def upvote
    @question = Question.find(params[:id])
    @question.vote += 1
    @question.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "updated_at" = $1, "vote" = $2 WHERE "questions"."id" = 2  [["updated_at", "2015-05-20 00:41:28.636105"], ["vote", 1]]

  def downvote
    @question = Question.find(params[:id])
    @question.vote -= 1 if @question.vote > 0
    @question.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "updated_at" = $1, "vote" = $2 WHERE "questions"."id" = 2  [["updated_at", "2015-05-20 00:41:48.993348"], ["vote", 0]]