app/controllers/answers_controller.rb

	def create
    p '*' * 90
    p params
    p '*' * 90
		@question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

	def update
    p params
    p "^" * 100
    @answer = Answer.find(params[:id])
    @answer.votes += 1 if params[:vote] == "Upvote"
    @answer.votes -= 1 if params[:vote] == "Downvote"
    @answer.save
---
UPDATE "answers" SET "votes" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["votes", 1], ["updated_at", "2015-07-07 23:44:19.812868"], ["id", 1]]