app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
    @answer.question_id = params["question_id"]
    if @answer.save
---
INSERT INTO "answers" ("answer", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["answer", "weather answer 2"], ["question_id", 1], ["created_at", "2015-07-07 01:43:39.317351"], ["updated_at", "2015-07-07 01:43:39.317351"]]

  def upvote
    @answer.vote_count += 1
    if @answer.save
---
INSERT INTO "votes" ("votable_id", "votable_type", "voter_id", "voter_type", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "votes" SET "vote_flag" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["vote_flag", "t"], ["updated_at", "2015-07-07 23:22:47.845066"], ["id", 8]]

  def downvote
    @answer.vote_count -= 1 if @answer.vote_count > 0
    if @answer.save
---
INSERT INTO "votes" ("votable_id", "votable_type", "voter_id", "voter_type", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "votes" SET "vote_flag" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["vote_flag", "f"], ["updated_at", "2015-07-07 23:22:47.077940"], ["id", 8]]

  def set_answer
    @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 5]]