app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TV"], ["content", "Do you watch TV?"], ["user_id", 1], ["created_at", "2015-07-07 07:14:31.174256"], ["updated_at", "2015-07-07 07:14:31.174256"]]
---
  def create
    @question = Question.new(question_params)

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "content" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["content", "How is it outside????"], ["updated_at", "2015-07-07 02:18:29.302722"], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def upvote
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def downvote
    @question = Question.find(params[:id])