app/controllers/sessions_controller.rb

  def create
  	@user = User.where(username: params[:session][:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "tomtom"]]