app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "tomtom"], ["email", "tom@tom.com"], ["password", "tomtom"], ["created_at", "2015-07-07 00:31:24.167832"], ["updated_at", "2015-07-07 00:31:24.167832"]]